Revit 2027 API
BuiltInFailures.BendFailures.NotBentModelLine Property
 While making curved beam type "[Type Name]" some Model Line elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentModelLine { get; }
Public Shared ReadOnly Property NotBentModelLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentModelLine {
	FailureDefinitionId^ get ();
}
static member NotBentModelLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace